{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "Map_I_0", "trainable": true, "batch_input_shape": [null, 64], "dtype": "float64", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "Map_I_Act_0", "trainable": true, "dtype": "float64", "alpha": 0.2}}, {"class_name": "Dense", "config": {"name": "Map_I_1", "trainable": true, "dtype": "float64", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "Map_I_Act_1", "trainable": true, "dtype": "float64", "alpha": 0.2}}, {"class_name": "Dense", "config": {"name": "Map_L_0", "trainable": true, "dtype": "float64", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "Map_L_Act_0", "trainable": true, "dtype": "float64", "alpha": 0.2}}, {"class_name": "Dense", "config": {"name": "Map_L_1", "trainable": true, "dtype": "float64", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "Map_L_Act_1", "trainable": true, "dtype": "float64", "alpha": 0.2}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}