{"class_name": "Model", "config": {"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 64], "dtype": "float64", "sparse": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "ConstantLayer", "config": {"name": "Gen_Constant", "trainable": true, "dtype": "float64"}, "name": "Gen_Constant", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float64", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["Gen_Constant", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Gen_Constant_Dense", "trainable": true, "dtype": "float64", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Constant_Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "Gen_Reshape", "trainable": true, "dtype": "float64", "target_shape": [8, 8, 12]}, "name": "Gen_Reshape", "inbound_nodes": [[["Gen_Constant_Dense", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float64", "sparse": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_8_A", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_8_A", "inbound_nodes": [[["Gen_Reshape", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_8_A", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_8_A", "inbound_nodes": [[["input_2", 0, 0, {}], ["Gen_Noise_8_A", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_8", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_8", "inbound_nodes": [[["Gen_AdaIN_8_A", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLU_8", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLU_8", "inbound_nodes": [[["Gen_Conv_8", 0, 0, {}]]]}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_8_B", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_8_B", "inbound_nodes": [[["Gen_LeReLU_8", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_8_B", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_8_B", "inbound_nodes": [[["input_2", 0, 0, {}], ["Gen_Noise_8_B", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "Gen_Up_16", "trainable": true, "dtype": "float64", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "Gen_Up_16", "inbound_nodes": [[["Gen_AdaIN_8_B", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_16_A", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_16_A", "inbound_nodes": [[["Gen_Up_16", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_16_A", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_16_A", "inbound_nodes": [[["Gen_Conv_16_A", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float64", "sparse": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_16_A", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_16_A", "inbound_nodes": [[["Gen_LeReLu_16_A", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_16_A", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_16_A", "inbound_nodes": [[["input_5", 0, 0, {}], ["Gen_Noise_16_A", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_16_B", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_16_B", "inbound_nodes": [[["Gen_AdaIN_16_A", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_16_B", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_16_B", "inbound_nodes": [[["Gen_Conv_16_B", 0, 0, {}]]]}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_16_B", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_16_B", "inbound_nodes": [[["Gen_LeReLu_16_B", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_16_B", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_16_B", "inbound_nodes": [[["input_5", 0, 0, {}], ["Gen_Noise_16_B", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "Gen_Up_32", "trainable": true, "dtype": "float64", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "Gen_Up_32", "inbound_nodes": [[["Gen_AdaIN_16_B", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_32_A", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_32_A", "inbound_nodes": [[["Gen_Up_32", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_32_A", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_32_A", "inbound_nodes": [[["Gen_Conv_32_A", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float64", "sparse": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_32_A", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_32_A", "inbound_nodes": [[["Gen_LeReLu_32_A", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_32_A", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_32_A", "inbound_nodes": [[["input_7", 0, 0, {}], ["Gen_Noise_32_A", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_32_B", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_32_B", "inbound_nodes": [[["Gen_AdaIN_32_A", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_32_B", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_32_B", "inbound_nodes": [[["Gen_Conv_32_B", 0, 0, {}]]]}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_32_B", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_32_B", "inbound_nodes": [[["Gen_LeReLu_32_B", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_32_B", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_32_B", "inbound_nodes": [[["input_7", 0, 0, {}], ["Gen_Noise_32_B", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "Gen_Up_64", "trainable": true, "dtype": "float64", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "Gen_Up_64", "inbound_nodes": [[["Gen_AdaIN_32_B", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_64_A", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_64_A", "inbound_nodes": [[["Gen_Up_64", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_64_A", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_64_A", "inbound_nodes": [[["Gen_Conv_64_A", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float64", "sparse": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_64_A", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_64_A", "inbound_nodes": [[["Gen_LeReLu_64_A", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_64_A", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_64_A", "inbound_nodes": [[["input_9", 0, 0, {}], ["Gen_Noise_64_A", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_64_B", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_64_B", "inbound_nodes": [[["Gen_AdaIN_64_A", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_64_B", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_64_B", "inbound_nodes": [[["Gen_Conv_64_B", 0, 0, {}]]]}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_64_B", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_64_B", "inbound_nodes": [[["Gen_LeReLu_64_B", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_64_B", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_64_B", "inbound_nodes": [[["input_9", 0, 0, {}], ["Gen_Noise_64_B", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "Gen_Up_128", "trainable": true, "dtype": "float64", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "Gen_Up_128", "inbound_nodes": [[["Gen_AdaIN_64_B", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_128_A", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_128_A", "inbound_nodes": [[["Gen_Up_128", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_128_A", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_128_A", "inbound_nodes": [[["Gen_Conv_128_A", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float64", "sparse": false, "name": "input_11"}, "name": "input_11", "inbound_nodes": []}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_128_A", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_128_A", "inbound_nodes": [[["Gen_LeReLu_128_A", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_128_A", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_128_A", "inbound_nodes": [[["input_11", 0, 0, {}], ["Gen_Noise_128_A", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Gen_Conv_128_B", "trainable": true, "dtype": "float64", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Gen_Conv_128_B", "inbound_nodes": [[["Gen_AdaIN_128_A", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Gen_LeReLu_128_B", "trainable": true, "dtype": "float64", "alpha": 0.2}, "name": "Gen_LeReLu_128_B", "inbound_nodes": [[["Gen_Conv_128_B", 0, 0, {}]]]}, {"class_name": "NoiseLayer", "config": {"name": "Gen_Noise_128_B", "trainable": true, "dtype": "float64"}, "name": "Gen_Noise_128_B", "inbound_nodes": [[["Gen_LeReLu_128_B", 0, 0, {}]]]}, {"class_name": "AdaptiveInstanceNormalizationLayer", "config": {"name": "Gen_AdaIN_128_B", "trainable": true, "dtype": "float64"}, "name": "Gen_AdaIN_128_B", "inbound_nodes": [[["input_11", 0, 0, {}], ["Gen_Noise_128_B", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "toRGB", "trainable": true, "dtype": "float64", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "toRGB", "inbound_nodes": [[["Gen_Up_128", 0, 0, {}]], [["Gen_AdaIN_128_B", 0, 0, {}]]]}, {"class_name": "MixLayer", "config": {"name": "Gen_Mix_128", "trainable": true, "dtype": "float64", "alpha": 0.625}, "name": "Gen_Mix_128", "inbound_nodes": [[["toRGB", 0, 0, {}], ["toRGB", 1, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_5", 0, 0], ["input_7", 0, 0], ["input_9", 0, 0], ["input_11", 0, 0], ["input_3", 0, 0]], "output_layers": [["Gen_Mix_128", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}